{
  "name": "符咒的效果",
  "icon": "divinefavor:spell_talisman_blink",
  "category": "basics",
  "read_by_default": true,
  "sortnum": 6,
  "pages": [
    {
      "type": "spotlight",
      "item": "divinefavor:spell_talisman_blink",
      "text": "某些符咒拥有可以根据你需求调整的效果。For example$(item)Blink talisman$() has distance property.这种效果决定了符咒会把你传送多远。"
    },
    {
      "type": "text",
      "text": "你需要按下效果 GUI 键才能改变符咒的效果。默认 GUI 键为 R。 当你按下这个键，GUI 界面就会出现。如果符咒拥有可以调整的效果，所以的效果都会在屏幕左侧显示。For each property there will be corresponding slider, a button, or other gui element. When you hover over any button or slider a tooltip for this element will be shown on the left side of screen."
    },
    {
      "type": "text",
      "text": "You can freely change any available properties on talisman, but keep in mind that property may change cost of talisman use. For example the bigger is distance set on blink talisman, the more favor usage will cost. Talisman properties are abundant on build talismans. Most of the properties in gui you can chandge by either clicking slider or button with a mouse or by hovering gui element with your mouse and scrolling mouse wheel."
    },
    {
      "type": "text",
      "text": "You can reset any property to default value by middle clicking gui element. You also will notice small green marker on the right side of one of the properties. This marker shows currently selected property. Whenever you change value of property it is automatically selected. When you scroll mouse in property gui and you are not hovering any property then scrolling will affect selected property."
    },
    {
      "type": "text",
      "text": "Similarly if you click middle mouse button and not hovering anything, then selected property will be reset to default. You can also select properties without changing them by clicking them with right mouse. Also when property gui is displayed you may notice additional talisman icon at the top of the screen. If you hover this icon then text description of the talisman will be displayed on the left side of the screen."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:spell_talisman_searing_pulse",
      "text": "So if you forgot what talisman does you can quickly check its description in property gui. Above you will see an example of another spell talisman with adjustable property. Property on this talisman controls how many blocks to smelt."
    }
  ]
}